/*//////////////////////文件说明//////////////////////////
//														//
//文件名: WinProc.h					           			//
//功  能: 功能函数的声明								//
//作  者:												//
//														//
////////////////////////////////////////////////////////*/

#include <WINDOWS.H>
#include <MATH.H>
#include <STDLIB.H>
#include <TIME.H>
#include <commctrl.h>
#include "resource.h"
#include "WinMine.h"
#include <string.h>
#include <stdio.h>
#include "htmlhelp.h"

/*###########################################################
功能：主窗口的消息处理回调函数
参数：
返回值：
###########################################################*/

LRESULT CALLBACK WndProc (HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam);

/*###########################################################
//功能：对话框消息处理
//参数：
//返回值：
//#########################################################*/

BOOL CALLBACK WinDlgProc(HWND hDlg, UINT message, WPARAM wParam, LPARAM lParam);

/*###########################################################
功能：初始化地图基本信息
参数：窗口句柄、等级、宽、高、雷、标志数、时间计数标志、表情标志
返回值：成功 返回TRUE
###########################################################*/

BOOL IinitializeMapInfo(HWND hWnd,int level,int col,int ln,int bomb,int playFlag,int timeFlag,int faceFlag);

/*###########################################################
//功能：生成随机地图
//参数：窗口句柄
//返回值：
//###########################################################*/

BOOL CreateRandomMap(HWND hWnd);

/*###########################################################
功能：得到鼠标的位置和状态
参数：窗口句柄、实例句柄、x坐标、y坐标、当前类型
返回值：当前鼠标的信息结构体
###########################################################*/

tagMouseState getMousePosition(HWND hWnd,HINSTANCE hInstance,int cxMousePos,int cyMousePos,int mouseType);

/*###########################################################
功能：左键弹起后改变地图上方格的信息
参数：窗口句柄、实例句柄、鼠标信息
返回值：
###########################################################*/

BOOL OnChangeMineInfo(HWND hWnd,HINSTANCE hInstance,tagMouseState mouse);

/*###########################################################
功能：游戏失败
参数：窗口句柄、实例句柄
返回值：
###########################################################*/

BOOL setGameLost(HWND hWnd,HINSTANCE hInstance);

/*###########################################################
功能：获得当前等级窗口的位置和大小信息
参数：窗口句柄
返回值：区域 左上的坐标（left，top）大小（right，bottom）
###########################################################*/

RECT getLevelWindowSize(HWND hWnd);

/*###########################################################
功能：描绘3D边框
参数：HDC，区域、线宽
返回值：
###########################################################*/

BOOL DrawSolidFrame(HDC hDC,RECT rcFrame,int iLighten);

/*###########################################################
功能：	生成一个矩形区域，如果后两个参数为0，得到的是一个雷的大小的区域，否则是两点参数的区域
参数：		
返回值：
###########################################################*/
RECT CreateRect(int left,int top,int right,int bottom);

/*###########################################################
功能：获得周围雷的数目
参数：窗口句柄、所在位置
返回值：周围雷的数目
###########################################################*/

BYTE getRoundMineNum(HWND hWnd,int iCol,int iLn);

/*###########################################################
功能：获得周围旗子的数目
参数：窗口句柄、所在位置
返回值：周围旗子的数目
###########################################################*/

BYTE getRoundFlagNum(HWND hWnd,int iCol,int iLn);

/*###########################################################
功能：刷新表情图片区域
参数：窗口句柄、表情类型
返回值：
###########################################################*/

BOOL RefreshSmileFaceBmp(HWND hWnd,int iFaceType);

/*###########################################################
功能：鼠标消息处理
参数：窗口句柄、实例句柄、当前鼠标结构体、自定义消息类型
返回值：
###########################################################*/

BOOL OnMouseClick(HWND hWnd,HINSTANCE hInstance,tagMouseState mouse,int nIDMessage);

/*###########################################################
功能：设置等级改变后菜单的check
参数：菜单句柄、等级
返回值：
###########################################################*/

BOOL OnCheckLevelMenu(HMENU hMenu,int level);

/*###########################################################
功能：处理游戏成功
参数：
返回值：
###########################################################*/

BOOL setGameSucceed(HWND hWnd,HINSTANCE hInstance);

/*###########################################################
功能：错误消息对话框
参数：窗口句柄、实例句柄、消息、消息id
返回值：
###########################################################*/

BOOL ErrorMessageBox(HWND hWnd,HINSTANCE hInstance,UINT IDMessage,UINT IDError);

/*###########################################################
功能：是方格显示为按下的状态
参数：鼠标位置结构体
返回值：
###########################################################*/

BOOL OnChangeMineDown(tagMouseState mouse);

/*###########################################################
功能：还原显示为按下状态的方格
参数：鼠标位置结构体
返回值：
###########################################################*/

BOOL OnChangeMineUpon(tagMouseState mouse);
